src/InformationRegisters/ИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗвонков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Comment>notification_name</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗвонящийНомер</Name>
					<Comment>called_phone_number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВызываемыйНомер</Name>
					<Comment>calling_phone_number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Comment>start_time (YYYY-MM-DD hh:mm:ss.ttt)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Comment>total_time_duration</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Comment>wait_time_duration</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаЗапись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Comment>virtual_phone_number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Входящий</Name>
					<Comment>direction=in</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСессии</Name>
					<Comment>call_session_id: (10-11 цифр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/HTTPServices/UIScom/Ext/Module.bsl
// Функция - Incoming call /IN
// Делаем запись в рс.ИсторияЗвонков и отправляем номер входящего звонка в Centrifugo на Канал оператора!
//
// ТелоЗапроса = {
// "direction":{{direction}},
// "notification_name":{{notification_name}},
// "notification_mnemonic":{{notification_mnemonic}},
// "virtual_phone_number":{{virtual_phone_number}},
// "notification_time":{{notification_time}},
// "scenario_name": {{scenario_name}},
// "start_time":{{start_time}},
// "called_phone_number":{{called_phone_number}},
// "calling_phone_number":{{calling_phone_number}},
// "call_session_id":{{call_session_id}}
// }
//
// Параметры:
//  Запрос - HttpЗапрос - входящий запрос - получаем Тело 
// 
// Возвращаемое значение:
// HTTPСервисОтвет - ответ на входящий запрос
//
Функция IncomingCall_IN(Запрос)
  КодСостояния = 200;  // по умолчанию Ok
  Причина = ""; 
  
  ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку(); 
  
  структураПолей = UIScomСервер.JSON_в_Данные(ТелоЗапроса);
  
  Если ПустаяСтрока(ТелоЗапроса) 
	  Или структураПолей = Неопределено Тогда
	  Причина = "Empty body of request or body not JSON-text!";
	  КодСостояния = 400;
	  
  ИначеЕсли типЗнч(структураПолей) <> тип("Структура") Тогда 
	  Причина = "Error in JSON. Not structure!";
	  КодСостояния = 400;
	  
  Иначе // --------------------------------------------------------   
	  стрЗвонка = UIScomСервер.ПолучитьСтруктуруПолейИсторииЗвонков(структураПолей);
	  Если НЕ стрЗвонка.Свойство("Входящий") Тогда
		  стрЗвонка.Добавить("Входящий", Истина);
	  КонецЕсли;
	  
	  Если стрЗвонка.Входящий Тогда
		  Канал = CentrifugoСервер.ПолучитьКаналПоНомеру( стрЗвонка.Номер );   
		  стрЗвонка.Добавить("Канал", Канал);                                               
		  
		  Отправлен = CentrifugoСервер.ПослатьСообщениеНаКанал( стрЗвонка ); // отправка !!!
		  стрЗвонка.Добавить("Отправлен", Отправлен);                                       
		  
		  Если НЕ Отправлен Тогда 
			  Причина = "Error Centrifugo send to channel: " + Канал + " !";
			  КодСостояния = 417;
		  КонецЕсли;
		  
	  КонецЕсли;
	  
	  стрЗвонка.Добавить("ТелоЗапроса", ТелоЗапроса); // весь запрос
	  РегистрыСведений.ИсторияЗвонков.СоздатьЗапись( стрЗвонка );
  КонецЕсли;	
  
  Ответ = Новый HTTPСервисОтвет(КодСостояния, Причина);
  Возврат Ответ;
КонецФункции  

// Функция - Outcoming call OUT
// Делаем запись в рс.ИсторияЗвонков, НО ничего не отправляем в Centrifugo!
//
// Параметры:
//  Запрос - HttpЗапрос - входящий запрос - получаем Тело 
// 
// Возвращаемое значение:
// HTTPСервисОтвет - ответ на входящий запрос
//
Функция OutcomingCall_OUT(Запрос)
	Ответ = IncomingCall_IN(Запрос); 
	Возврат Ответ;
КонецФункции

// Функция - Record end REC
// Получаем существующую запись по измерениям и Добавляем данные!
//
// Параметры:
//  Запрос - HttpЗапрос - входящий запрос - получаем Тело 
// 
// Возвращаемое значение:
// HTTPСервисОтвет - ответ на входящий запрос
//
Функция RecordEnd_REC(Запрос)
  КодСостояния = 200;  // по умолчанию Ok
  Причина = ""; 
  
  ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку(); 
  
  структураПолей = UIScomСервер.JSON_в_Данные(ТелоЗапроса);
  
  Если ПустаяСтрока(ТелоЗапроса) 
	  Или структураПолей = Неопределено Тогда
	  Причина = "Empty body of request or body not JSON-text!";
	  КодСостояния = 400;
	  
  ИначеЕсли типЗнч(структураПолей) <> тип("Структура") Тогда 
	  Причина = "Error in JSON. Not structure!";
	  КодСостояния = 400;
	  
  Иначе // --------------------------------------------------------   
	  стрЗвонка = UIScomСервер.ПолучитьСтруктуруПолейИсторииЗвонков(структураПолей);
	  
	  стрЗаписи = РегистрыСведений.ИсторияЗвонков.ПолучитьЗапись(стрЗвонка.Номер, стрЗвонка.Входящий, стрЗвонка.ИдСессии); 
	  Если стрЗаписи = Неопределено Тогда
	 	  стрЗвонка.Добавить("ТелоЗапроса", ТелоЗапроса); // весь запрос
		  стрЗаписи = стрЗвонка;
	  Иначе	  
		  Для каждого эл Из стрЗвонка Цикл 
			стрЗаписи.Вставить( эл.Ключ, эл.Значение);	// добавление данных в готовую запись!   
		  КонецЦикла;
	  КонецЕсли;
	  
	  РегистрыСведений.ИсторияЗвонков.СоздатьЗапись( стрЗаписи );
  КонецЕсли;	
  
  Ответ = Новый HTTPСервисОтвет(КодСостояния, Причина);
  Возврат Ответ;
КонецФункции

Функция ПингGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200, "Its Work!");
	Возврат Ответ;
КонецФункции
